In [2]:
import numpy as np
import pandas as pd

In [23]:
ser= pd.Series(np.arange(1,7), index= list("ABCDEF"))
ser

A    1
B    2
C    3
D    4
E    5
F    6
dtype: int32

In [24]:
#numpy fn on series
np.mean(ser) #mean of series
np.median(ser) #median of series
np.amax(ser) #max of series

3.5

In [27]:
#applying multiple functions 
ser.agg([np.min, np.max, np.mean])

amin    1.0
amax    6.0
mean    3.5
dtype: float64

In [28]:
#creating dataframe by applying functions on series
#transform
ser.transform({'A':lambda x:x**2, 'B': lambda x: x+1})

    A  B
A   1  2
B   4  3
C   9  4
D  16  5
E  25  6
F  36  7

In [29]:
#transform
def square(x):
    return x**2
def sqr_root(x):
    return x**0.5
ser.transform([square, sqr_root])

   square  sqr_root
A       1  1.000000
B       4  1.414214
C       9  1.732051
D      16  2.000000
E      25  2.236068
F      36  2.449490

In [34]:
ser1= pd.Series([2, 7, 4, 8, 9, np.NaN], index= list("ABCDEF"))
ser1

A    2.0
B    7.0
C    4.0
D    8.0
E    9.0
F    NaN
dtype: float64

In [36]:
#adding 2 series 
#handling nan val
#fill_value
ser.add(ser1, fill_value=0) #changes nan value to 0
#.sub, .mul, .div

A     3.0
B     9.0
C     7.0
D    12.0
E    14.0
F     6.0
dtype: float64

In [38]:
ser.sub(ser1)  #ser-ser1
ser.rsub(ser1) #ser1- ser

A    1.0
B    5.0
C    1.0
D    4.0
E    4.0
F    NaN
dtype: float64

In [39]:
#combine two series
ser.combine(ser1, max) #give new series by choosing max values from both series

A    2
B    7
C    4
D    8
E    9
F    6
dtype: int32

In [41]:
#round
ser2= pd.Series([2.459, 6.93])
ser2.round(decimals=1)

0    2.5
1    6.9
dtype: float64

In [44]:
ser.lt(2) #less than
ser.gt(3) #greater than
ser.eq(3) #equal
# ne- not equal, ge(>=), le(<=)

A    False
B    False
C     True
D    False
E    False
F    False
dtype: bool

In [48]:
ser.all() #true if all are true
ser.any() #true if atleast 1 is true
ser.between(1,3) #true for values b/w range
ser.count() #count of elements

6

In [3]:
#join all elements of series
ser= pd.Series(list("abcd"))
ser.str.cat(sep=",")

'a,b,c,d'